[
  {
    "ratings": [
      {
        "score": 2,
        "comment": "Quaint and small cafe. My food and latte were pretty good, but the price was quite a shock. I wasn't expecting the $20 for a breakfast sandwich and small (8oz) latte.\n\nMy low review is purely based on the price. I think if you go in knowing a bit more about the costs than I did, I think you'll like the place."
      },
      {
        "score": 5,
        "comment": "A beautiful place to hang out and grab a good cup of coffee"
      },
      {
        "score": 4,
        "comment": "Great iced matcha latte!"
      },
      {
        "score": 5,
        "comment": "If you take a seat outside in the morning, you can enjoy a really pleasant and refreshing atmosphere.\nfriendly staff,\nWarmed cinnamon bun,\nIced Americano is the best around here^^"
      },
      {
        "score": 1,
        "comment": "Molds found in muffin. Tasted it - def molds, not blueberries."
      },
      {
        "score": 3,
        "comment": "I finally tried their food offerings after several visits of coffee runs. Unfortunately, all I could taste was how oily the sandwich became after they heated it up for me. The taste lingered in my throat all day after. A shame because I quite enjoy their beverages, however I don’t think I’ll get their food ever again."
      },
      {
        "score": 5,
        "comment": "Location is fantastic with outdoor seating surrounded by gardens. Interior of the shop is cozy, reminiscent of a log cabin. There used to be a few baristas that came off as aloof, but for the past year or so I’ve had only pleasant interactions with the staff. I haven’t had anything here that hasn’t been delicious. They have a great variety of vegetarian and vegan food and the portions are pretty generous. I really like their tea selection, they make a good matcha latte, and the espresso’s not bad either."
      },
      {
        "score": 5,
        "comment": "I was genuinely impressed at how good the cold brew here is! It has this almost chocolaty smoothness to it. Lots of lovely seating outside too! Probably best place on campus."
      },
      {
        "score": 2,
        "comment": "Yes, the atmosphere is perfect and cozy. However, they are taking advantage of the convenient location at UBC, and it seems they don't care much about customer service\n\n1. The dining tables are always itchy to the point that my mouse always sticks to the table; they don't know how to clean them properly.\n2. There is outdoor space for people with dogs, but it's irresponsible of the coffee shop owner to allow dog owners inside when there is a designated space for them. This action goes against the cleaning protocols of a café and is inconsiderate of their customers who might choose to sit inside because they don't want to be around dogs!!"
      },
      {
        "score": 1,
        "comment": "Terribly expensive and the food and beverages don't warrant this exorbitant price. I find it fascinating and disappointing that they're charging these prices at a University where students presumably make the majority of their patronage. I also feel that their beverage sizes are smaller compared to other coffee shops.\n\nAlso, being a cafe, I find it odd that there are barely any charging ports- loads of people are working on their laptops at any given time and it's very inconvenient to have to move in search for a charging port. The seating is also super crammed. I'm willing to compromise on the latter grievances but not the prices. I will be buying my coffee elsewhere."
      }
    ],
    "food_outlet": {
      "name": "Bean Around The World Coffee House & Bistro",
      "location": "UBC"
    }
  },
  {
    "ratings": [
      {
        "score": 4,
        "comment": "A good place to have breakfast and meals including Waffles. It is located in middle of Surrey, BC downtown."
      },
      {
        "score": 5,
        "comment": "Everything was excellent. Fresh, proper, delicious, amazing waffles, affordable, warmest service, just excellent. Yeah no other words, excellent. "
      },
      {
        "score": 4,
        "comment": ""
      },
      {
        "score": 5,
        "comment": "We had brunch here and their was a wide array of food choices and beverages to choose from . Hubby had blueberry pancakes and I had the Classic Benny . The food tasted amazing so we decided to share an order of the raspberry creme brûlée French toast . Was a perfect finish as a dessert option . The mimosa was yum and we also had unlimited coffee . The restaurant is always busy and quite popular . It has a modern touch to its decor and cool ambience . It’s good to give it a try and you’ll definitely enjoy the experience . Bon Apetite"
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": "I had the Strawberry Cream Waffle and it was sooo Delicious!! It was one of THE BEST Waffles I've ever had!!\n\nIf you have the chance, go check this place out.. "
      },
      {
        "score": 1,
        "comment": "We found like a metal strip and when we informed them. They were neither surprised nor did take any action. They just offered to replace the food. Very bad quality food and the service was also bad."
      },
      {
        "score": 5,
        "comment": "In an unexpected twist, Surrey, BC has become home to a diner that marries Americana kitsch with Canadian culinary flair. The Waffle House Diner (no relation to the Southern U.S. chain) serves up nostalgia with a side of innovation.\n\nThe star of the show is their breakfast poutine, a morning riff on the Quebec classic. Crispy potato cubes replace the traditional fries, while a silky hollandaise stands in for gravy. Soft-boiled eggs crown this indulgent mess, their yolks mingling with squeaky melted cheese curds to create a sauce that's equal parts comforting and luxurious. It's the kind of dish that makes you question why you'd ever settle for plain old hash browns again, scrambled eggs, and bacon.\n\nThe coffee ($3, bottomless) is mercifully robust, a far cry from the watery swill often masquerading as diner java. It's the perfect foil to the rich poutine, cutting through the richness and providing that much-needed caffeine kick and diner’s strength.  I no longer eat Whitespot for breakfast do to the fact that their pale watery bottomless coffee is $7! So $3 for a very decent cup of diner coffee.\n\nService comes with a smile, courtesy of a young staff that seems genuinely pleased to be there. The vibe is pure Vancouver—effortlessly friendly without being cloying.\n\nThe space itself is a clever blend of retro and modern. Chrome and Formica abound, but there's breathing room between tables—a luxury in diner terms. It's as if a 1950s greasy spoon got a makeover from a minimalist Scandinavian designer.\n\nWhile it may not reach the heights of culinary greatness, Waffle House Diner offers an above average solid breakfast experience with a uniquely West Coast Canadian twist. It's comfort food that doesn't take itself too seriously—much like Surrey itself."
      },
      {
        "score": 5,
        "comment": "Staff really friendly, delicious food and fast service\nBest breakfast place i’ve tried in Surrey!"
      },
      {
        "score": 5,
        "comment": "It's my first time visiting. I was seated right away and served  a hot tea in a timely manner. My server came over right away and brought me a nice glass of ice water. And suggested their house specials. I had The Waffle House special. Everything was hot and delicious. The truffle chive potatoes are really good. Can't say enough about the great service. And I'd love to try more items on their menu as they offer eggs, bemnie,smash burgers And a selection of delicious breakfast items\nThey also have some great sandwiches on the menu. The daily breakfast special was served till eleven and it was only $13 Including coffee or tea."
      },
      {
        "score": 5,
        "comment": "This place serves the absolute best waffles I've ever had, and their syrup is fantastic too!"
      }
    ],
    "food_outlet": {
      "name": "Waffle House Diner",
      "location": "Surrey Central"
    }
  },
  {
    "ratings": [
      {
        "score": 4,
        "comment": ""
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": "Great food and ambience! Loved that they had compostable packaging and cutlery and the option to use Shareware. I would urge them to have an option for sit down meals with reusable utensils so that less waste is created to begin with!"
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": "Delicious food that hits every single time. I recommend this place to everyone!"
      },
      {
        "score": 5,
        "comment": "Great"
      },
      {
        "score": 5,
        "comment": "An absolutely perfect lunch - definitely get the Makali wrap!"
      },
      {
        "score": 5,
        "comment": "I eat here more than I should."
      }
    ],
    "food_outlet": {
      "name": "Jamjar Canteen",
      "location": "UBC"
    }
  },
  {
    "ratings": [
      {
        "score": 5,
        "comment": "Great pizza from wooden oven"
      },
      {
        "score": 5,
        "comment": "We ordered California pizza and spicy chicken pasta.\n\nPizza is cheesy and crust was crispy.\n\nPasta was filled with flavours of tomato, chicken and mushroom. Loved both and we will definitely return.\n\nCustomer service is great and outstanding.\n\nHave seating capacity for about 16, 4 tables with 4 chairs each."
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": "This place is a new down home favourite.\n\nA lovely and super nice Iranian family cooks here and runs it. The spaghetti bolognaise is some of the best spaghetti bolognaise I have had anywhere out. To qualify that, I hold myself as a spaghetti bolognaise connoisseur and it’s my favourite meal. I knew there was something different and found out it was unusual spices, like cinnamon. It was so wonderfully sweet that I thought there must be sugar too but they said it was just the onions they use. So good!\n\nI want to come back to try the lasagna that apparently has some nutmeg too. Exciting!\n\nCan of Coca Cola came with a chilled glass - nice touch."
      },
      {
        "score": 5,
        "comment": "Delicious pizza with nice thin to medium crust. The staff was very friendly and nice with lots of good suggestion on what to try for the first time customers"
      },
      {
        "score": 5,
        "comment": "It's been a long time since we had such delicious Italian food \nAnd fast and friendly service..."
      },
      {
        "score": 5,
        "comment": "Delicious pizza"
      },
      {
        "score": 5,
        "comment": "Really lovely, quick place to grab a bite! The staff were all really lovely and the food was tasty!"
      },
      {
        "score": 4,
        "comment": ""
      },
      {
        "score": 5,
        "comment": "Great pizza and garlic bread."
      }
    ],
    "food_outlet": {
      "name": "The Firewood Café",
      "location": "Broadway-City Hall"
    }
  },
  {
    "ratings": [
      {
        "score": 2,
        "comment": "I'm disappointed. I always order Barg Kebab from them, but each time, the amount of meat gets less and less."
      },
      {
        "score": 5,
        "comment": "Good service."
      },
      {
        "score": 5,
        "comment": "Food was great! So rich in flavour and extremely filling. So worth the price."
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 3,
        "comment": "Vaziri kabap was good. Service needs to be improved (e.g., speed). Tables, carpet, and bathrooms were not clean."
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": "Was a huge fan of the Broadway location and was super excited to have it come to UBC. The prices might seem a little pricey but the portions are huge. You could easily make 2 meals out of one if you wanted. I always get either the lamb and beef donair wrap or the lamb shank (falls off the bone)."
      },
      {
        "score": 5,
        "comment": "Really love the food there, worth the money and it’s actually not expensive!"
      },
      {
        "score": 1,
        "comment": "Best food to get a stomachache.\nThe chicken donair I got was dripping oil, and the chicken was cold."
      },
      {
        "score": 5,
        "comment": "Amazing food and service. The prices and good, with big portions. The flavors are authentic,fresh and so delicious. Best takeout on UBC Campus"
      }
    ],
    "food_outlet": {
      "name": "Sahel UBC",
      "location": "UBC"
    }
  },
  {
    "ratings": [
      {
        "score": 1,
        "comment": "Extremely bad！！！Sushi is too hard to swallow"
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 4,
        "comment": "The dining environment has a good atmosphere, the food is delicious, and there are not many dining tables and chairs."
      },
      {
        "score": 5,
        "comment": "Most affordable Japanese appetizers on campus!"
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": "really good food and fast service! I recommend it"
      },
      {
        "score": 5,
        "comment": "Great food at a great price! Friendly service too!!"
      },
      {
        "score": 3,
        "comment": ""
      },
      {
        "score": 5,
        "comment": "I can't say enough, but Nori bento is one of the most affordable and high-quality restaurants on campus if you're interested in Japanese food. From the bento options, I like the beef and katsu. For me, the bento is enough for two portions, but I usually eat less than a normal person, I think. The spicy udon noodles with spicy laska broth was nice, and my friend had a good experience. The spicy level for me was 8/10, but it was a nice kind of spiciness, so I definitely recommend it if you like spicy food. The sushi is also nice, but you need to visit the store in person as they're not available for delivery. We usually include one sushi roll, and they're always fresh and good. Also, they have nice staff, and they're pretty quick as well."
      }
    ],
    "food_outlet": {
      "name": "Nori Bento & Udon",
      "location": "UBC"
    }
  },
  {
    "ratings": [
      {
        "score": 1,
        "comment": "Overpriced and overhyped."
      },
      {
        "score": 5,
        "comment": "Wow, the loin katsu was so crispy outside and tender inside, and quite thick and large. Comes with heap of fresh cabage salad, miso soup, and tasty sesame dressing. Seasoned  seaweed and marinated cucumber side dishes were tasty, too, and the rice was so much I couldn't even finish it. Everything was generously portioned, and tasted good. All the staffs were very kind and attentive. Moreover, the tip was set from 8% to 12%! I have not seen this setting anywhere else in Vancouver. (Nowadays some places's tip setting even start FROM 18%...) The gesture was so nice, therefore I tipped more with willing heart. :) I hope your business prospers!"
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": "in my one month at UBC, i ate here at least 8-9 times and each time outshone the last. everything on their menu is really good and they have lots of promotions all the time too. i’d eat this every day if i could and maybe if they expanded their menu somemore!"
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": "I came here today for lunch with one of my friends and were pleasantly surprised by Beyond BBQ!! We both got the pork loin katsu ($17) and they had a special on where if you get any katsu you also get a free drink, so I got a supreme mango tea and my friend got the passion fruit tea. Everything was so delicious, and they gave us a TON of food for the price!!! The pork had an amazingly crispy breading and was flavourful without being dry, the miso soup came out hot (which I was very impressed by), and there was the perfect amount of rice. The sauces were good also and added a delicious pop of flavour!! Not to mention that the fruit tea was so flavourful and fresh!! The staff and servers were also lovely and did an incredible job, especially with giving recommendations. I would definitely come back!!"
      },
      {
        "score": 5,
        "comment": "I had an excellent dining experience. The ramen was delicious, the lamb skewers were perfectly cooked, and the fried udon was a delightful surprise. The service was friendly and attentive, and the prices were very reasonable for the quality of the food. I highly recommend this place to anyone looking for great food and great value. I’ll definitely be coming back"
      },
      {
        "score": 2,
        "comment": "Place is bright and clean. We both ordered the Shanghai thick noodles and the dishes took 25 min to arrive. Taste was unbelievably mediocre and the soup was too sour - neither of us finished. The opening deals on the menu are affordable though, especially for UBC, and maybe they taste better."
      }
    ],
    "food_outlet": {
      "name": "Beyond BBQ",
      "location": "UBC"
    }
  },
  {
    "ratings": [
      {
        "score": 1,
        "comment": ""
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 3,
        "comment": ""
      },
      {
        "score": 1,
        "comment": "Food not bad, same as other branches. However, the cashier who had a long braided pony tail on Sunday night, please wash your hair. It looked so greasy and dirty. Aren't you supposed to be tidy and clean when serving food to customers?\nI lost appetite."
      },
      {
        "score": 1,
        "comment": "So dirty. And no friendly"
      },
      {
        "score": 1,
        "comment": "When i order any take-out, they always forget minimum one product. They didnt give burger this time omg..."
      },
      {
        "score": 4,
        "comment": ""
      },
      {
        "score": 1,
        "comment": "This is the absolute worst Mcd’s I have ever experienced! Homeless people in just about every corner and a morning manager woman is just the rudest.. even put her bare hand in the warmer and touched the food with bare hands after handling cash! How is this franchise not cleaned up by head office? Brutal!"
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 1,
        "comment": "The lady who served us was incredibly rude! I actually couldn’t believe her attitude. Not just towards me but other customers too."
      }
    ],
    "food_outlet": {
      "name": "McDonald's",
      "location": "UBC"
    }
  },
  {
    "ratings": [
      {
        "score": 5,
        "comment": "The rare beef pho was the best I’ve had in Vancouver,  if not the world.  I also had a great chat with my server who was knowledgeable,  kind and extremely efficient.  I will always recommend this restaurant as the go to for Pho in Vancouver."
      },
      {
        "score": 5,
        "comment": "We have never eaten such a well made pho, ideally seasoned, portions - huge! :)\nDefinitely visit once more and definitely recommend a friend!"
      },
      {
        "score": 5,
        "comment": "The Lemongrass Chicken with spring rolls was extremely tasty and definitely worth the $19. While some comments suggest this place might not be the destination for authentic food, our experience was fantastic! The chicken was juicy, the salad was well-dressed, and the vermicelli was cooked to perfection. The portion sizes were so generous that we ended up taking most of our food home for later. I would definitely come back."
      },
      {
        "score": 1,
        "comment": "Wow.....It's like putting rice noodles in just water..."
      },
      {
        "score": 4,
        "comment": "Good portions and the soup is delicious. It is a bit pricey but I got a ton of meat in my pho. Not bad, better than food spots on university Blvd."
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 1,
        "comment": "Worst of the worst for a $19 pho. DONT GO"
      },
      {
        "score": 2,
        "comment": "A cockroach was crawling on the booth where I was eating. I just can't fathom going back here after seeing that."
      },
      {
        "score": 4,
        "comment": "For a pho place at UBC, it's pretty good but it lacks authenticity. I mean, the broth is great but you don't get a plate of bean sprouts and basil leaves like you do at other pho restaurants. I thought maybe at first, they forgot but my second time eating in, they forgot again. No one got it so that seems to be the norm. Service is prompt. Food is good. Also for big eaters, try to do an add-on. I added a lemongrass chicken to my pho and ended up bringing home 2 large pieces of grilled chicken for dinner. The servings are plentiful. Meat balls can be a little more plump, quail eggs in a seafood soup?? Music is a bit rad for this place too but catered to students, it's understandable."
      },
      {
        "score": 5,
        "comment": "I don’t know the owner, and i rarely leave reviews on google, but reading some weird reviews here made me do this. I can cook Pho at home and am 🇻🇳 but I approve the taste of Pho here, it’s decent and better than many places outside of Vietnam. Someone just complained about the fatty beef slices in the Pho they ordered, so i guess many people don’t understand there’re different types of beef you can order for Pho, get the sirloin cut (rare beef) one and it will be lean and soft. I like the beef broth, very southern style Pho of 🇻🇳.\n\nService was good, they’re just students working part-time and attentive, i had no problem.\n\nThe fact that they offered free extra broth and noodles is a plus. I never could finish a bowl of Pho there, so the portion is good. Maybe lower the price and put a smaller size in the menu. Chili sauce there is authentic (though siracha is not authentic sauce for Pho, and chili sauce in general for 🇻🇳)\n\nIt’s funny that looking at the pictures of the bad reviews made me crave for a Pho here so gonna order one now. You guys took pretty good pictures lol\n\nKeep in mind that not only this place, Pho restaurants outside of Vietnam don’t want to make it super authentic because they need to please 1001 tastes of nationality."
      }
    ],
    "food_outlet": {
      "name": "Pho With Us",
      "location": "UBC"
    }
  },
  {
    "ratings": [
      {
        "score": 5,
        "comment": "Great Korean. Loved the taste of the soy pork and bulgogi beef (plenty of sauce as well). Fried chicken was fire."
      },
      {
        "score": 5,
        "comment": "Great services! Auntie always smiles and has great customers. They food also very tasty... good portion. Very recommended!"
      },
      {
        "score": 5,
        "comment": "Really great value and excellent quality ingredients"
      },
      {
        "score": 5,
        "comment": "As someone born and raised in Korea, Corner Kitchen makes authentic Korean food that actually tastes like something you’d get in Korea. Absolutely love everything on their menu. Highly recommend!"
      },
      {
        "score": 5,
        "comment": "Good food, friendly service. Have been twice and will return."
      },
      {
        "score": 5,
        "comment": "Great (semi) hidden gem! Amazing food for good prices, the best spot when I’m craving some korean comfort food.\n\nThe people that run this place are always so nice, food is served quickly and service is top tier"
      },
      {
        "score": 2,
        "comment": "I got a beef bulgogi bowl and it was so salty it damn near gave me a heart attack. Barely edible. On the plus side, they now hold the record for the saltiest food I've ever tried. Maybe they did something wrong when they made my food? There's no way it's supposed to be this salty... I won't be giving them a second chance"
      },
      {
        "score": 4,
        "comment": "Portion could be slightly bigger for the price but the taste was good and service was very excellent for one person. Would take a date here."
      },
      {
        "score": 5,
        "comment": "So tasty. Please go eat here so they never leave."
      },
      {
        "score": 4,
        "comment": "Fair food, but the price is too high :("
      }
    ],
    "food_outlet": {
      "name": "The Corner Kitchen UBC",
      "location": "UBC"
    }
  },
  {
    "ratings": [
      {
        "score": 1,
        "comment": "kinda gross, service was bad and i found a bug in my food"
      },
      {
        "score": 1,
        "comment": "Dry chicken"
      },
      {
        "score": 4,
        "comment": "Food was very fresh and nicely prepared. Service was very warm and friendly but a little slow."
      },
      {
        "score": 5,
        "comment": "Made a reservation to celebrate my friends graduation, glad that they have a big table to accommodate all of us. Food were good, and we didn't have to wait too long. Price was students friendly, not too expensive. And the waitress was willing to separate the bills. Thank you."
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 1,
        "comment": ""
      },
      {
        "score": 5,
        "comment": "Really friendly staff and good priced food. Will be back the next time I’m in UBC"
      },
      {
        "score": 4,
        "comment": "Relatively good food at good prices for UBC. Love the gyu don, the beef Curry, and the fried bento boxes are quite nice too! I wish the tea was a little bit hotter though, but it's free so I can't complain. Sometimes the \"wait to be seated\" sign makes it hard to enter due to obstruction of the path though which can be a little frustrating"
      },
      {
        "score": 1,
        "comment": "really rude service :/ i asked for gluten free soy sauce (they normally always have it) and the server RUDELY (was working on april 13th) told me that i shouldn’t eat Japanese food because all of it has gluten? and then he rolled his eyes at my friend and i as we were leaving because i have an allergy… what kind of service is this! definitely never giving my money here ever again"
      },
      {
        "score": 1,
        "comment": "Waited forever in takeout for a single roll of sushi. Very overpriced too."
      }
    ],
    "food_outlet": {
      "name": "Ryuu Japanese Kitchen (UBC)",
      "location": "UBC"
    }
  },
  {
    "ratings": [
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": "The food is so tasty, the portions are huge and the value is excellent.\n\nI always take it to go though because I don't love the basement food court."
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": "The food is consistent and good. The service is fast and cheerful."
      },
      {
        "score": 4,
        "comment": "goated spot and proof of the 3.5 stars test"
      },
      {
        "score": 5,
        "comment": "After eating it for three years, the quality has always been stable. Regardless of whether it tastes good or not, it is definitely full."
      },
      {
        "score": 1,
        "comment": "Bad service!!!!! Do not force me to say what I wanna order. I m saying it! So rude and food is just a little even I added 3 dollars more. FAKE!!!!!!!"
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 2,
        "comment": "I was surprised that I could buy undersized lunch boxes in Vancouver. It was like the trembling lady in the mainland school cafeteria. There was too much food but not enough vegetables. My appetite was not very big, but I was definitely not full."
      }
    ],
    "food_outlet": {
      "name": "My Home Cuisine",
      "location": "UBC"
    }
  },
  {
    "ratings": [
      {
        "score": 5,
        "comment": "It was delicious, I strongly and highly recommend Pure Delight café to anyone who want to grab simple but so well done make with love Vietnamese food style. I repeat really delicious. I got myself a chicken curry, the rice was cook at perfection, the chicken was tender and the curry extra good, I’m hungry just to think about it again. And I also got the deep fried spring rolls. My friend got salad rolls and she was really happy with them. I’m gonna come back it’s sure as the quality of the ingredients and the food was excellente. Also thank you for our server she was nice and really helpful. We got served rapidly and as I said, delicious. Thank you so much for that great time and great dinner"
      },
      {
        "score": 5,
        "comment": "This cafe has a Vietnamese spirit and tasty food.\nI found here a plenty of yummy vegan options (vegan pho, lotus rice, fresh rolls), and  my family enjoyed all the meals.\nOne thing I noticed that differs from all Vietnamese cafes here - they don't bring a plate of mung bean sprouts, fresh basil and lime for Pho soups. It would be great to improve this."
      },
      {
        "score": 5,
        "comment": "Came around 6PM on a Wednesday, it was quiet so a lot of seating.\nThe pho was some of the best I’ve had in the area, and i’d love to try out more when i come again.\nMy partner tried the bun bo hue for the first time and said it was delicious as well. I’ve had it before at different places and think it’s not to everybody’s taste, but it’s done very well here.\nService was quick and kind, the place was clean.\nOverall, would come again"
      },
      {
        "score": 5,
        "comment": "Great vegan selection and super affordable in the city! more hole in the wall but i tell everyone about this place!  i love thé tropical vegan dish. bright, clean and the bathrooms are well maintained"
      },
      {
        "score": 4,
        "comment": "I came here on a Monday with my partner, just past the lunch rush and there was plenty of seating. This restaurant is nothing mind blowing, but I was happy with the service we got.  I was also happy with the music they were playing, as it was pop music vs. old school Viet music.  The food came out a little on the late side, but still within an acceptable amount of time. When the food did arrive though, it was tasty, good portion sizes and we left full.  Definitely not a bad place to eat if you're in the area."
      },
      {
        "score": 1,
        "comment": "Well. The cucumber was so fresh the label was still on. Besides that chicken bun mi we ordered had barely any chicken."
      },
      {
        "score": 2,
        "comment": "Live in the area and used to come to the bar call the village here often .\nBeen to this pho place a couple times now and today being the last .\nAsked for hot sauce or chili oil as any Vietnamese restaurant offers and the server told me it was in the broth , felt a very cold and wierd vibe . As if we were not wanted , even my daughter mentioned it to me .\n\nIt’s the small things that make or break a restaurant for me .\nI won’t be back and will never bring it up to the many friends in the area and business partners ."
      },
      {
        "score": 5,
        "comment": "Got the lemon grass chicken with added spring roll and coconut water as drink. The portion is good and the chicken is flavourful. Loving the coconut water also, it reminded me of home. Service was fast and friendly considering that there’s only one person doing everything. I got my food out in 10 minutes and warm"
      },
      {
        "score": 3,
        "comment": "Came here on a Sunday around noon. I was seated at a table prompted and presented with a menu, water and hot tea. Ordered spring rolls and lemongrass chicken with egg on rice. Spring rolls were good. They are the ones wrapped in rice paper and deep fried! Good flavour and good amount of filling. The rice dish was lacking flavour and I found the chicken portion to be small and the meat was quite dry. Dish was served with a small bowl of broth which was delicious. I will give this place another chance to try their pho!"
      },
      {
        "score": 3,
        "comment": "Below average for the price.  No basil or herbs in vermicelli bowl, so no aromatics Skimpy on the meat for the price - and a small amount of vermicelli.  Decent spring rolls\n\nCould improve with small adjustments."
      }
    ],
    "food_outlet": {
      "name": "Pure Delight Café",
      "location": "West Broadway"
    }
  },
  {
    "ratings": [
      {
        "score": 3,
        "comment": "It's not my first visit to Myst. Unlike other times, I came with my husband for dinner this time.\n\nWe are well aware that their portion is quite big, so we agreed to order some food to share. Taiwanese style pork knuckle, fried rice noodles with veggie and shredded pork and a soup with meat balls.\n\nThe pork knuckle is so so. It's quite tender but the flavor is rather mild. Perhaps that's the whole point of having a sauce with it. The sauce did enhance the flavor and made the pork knuckles more enticing. Among the food we ordered, my favorite is the fried rice noodle. It might look very plain and not that appealing in photo, but its very aromatic and flavorful. The magic came from the dried shrimps. They totally took the dish to a different level. The soup tasted like what it supposed to be. No surprise, bad or good.\n\nMyst is one of the restaurants that you can go for a late night meal coz it closes around midnight from Sunday to Thursday. On Friday and Saturday, it extends the hours to about 12:30am. Its menu offers you a great variety of food, bubble tea and desserts."
      },
      {
        "score": 5,
        "comment": "Excellent food and service. The popcorn chicken was cooked almost perfectly, with the right amount of spice and taste. We also ordered the shredded chicken with rice and the laksa with egg noodle. Both were absolutely delicious and amazing.\n\nThe service was great, seated quickly and food came really quick. Waitress was also very nice to us.\n\nAtmosphere was great. Although it can get a bit loud, it was nicely decorated.\n\nOverall would definitely recommend and would come back again to try new dishes."
      },
      {
        "score": 5,
        "comment": "I tried Myst for the first time when we got catering for a sports event a couple months back and enjoyed it so much we decided to come and try the food at the restaurant. I am happy to say it was expectedly much better at the restaurant. I came with a group of friends and shared a couple dishes. The portion sizes of all the dishes were quite large and we had leftovers to take home. My favourite dish was the chicken red curry. With the fried chicken and creamy curry, I thought it would be too heavy, but i found that the red and green bell peppers added a hint of freshness that helped with the heaviness of the dish. Overall a fantastic experience and will be back for seconds!"
      },
      {
        "score": 5,
        "comment": "As a professional food critic, I strive to provide honest and unbiased reviews, and my recent visit to this establishment deserves recognition. Having dined here several times, I found yesterday's experience particularly noteworthy due to its near perfection.\n\nTo start, I indulged in the green onion pancake as an appetizer. Its texture was crisp and flavorful, setting a promising tone for the meal. Following this, I savored the salt and pepper chicken, which was seasoned impeccably, and the pork soup dumplings, which were a delight with their tender meat and rich broth. To accompany my meal, I selected the peach slush bubble tea, which was refreshingly sweet and complemented the savory dishes beautifully.\n\nOverall, every item was executed to a high standard, impressing even my discerning palate. This visit reaffirmed the establishment's commitment to quality and taste, making it a standout choice in the area."
      },
      {
        "score": 3,
        "comment": "I believe MYST and No.1 beef noodle are owned by same person. However, overall the dishes and portion size- everything, really is just better at No.1 beef noodle.\n\nGotta love their kids menu.\n\nNot to say MYST is bad, more rather it's a comfy spacious dining environment. Until you're packed in the back area due to low seating\n\nService can be slow during lunch/dinner rushes as expected. It's not as bad as some places though, which have you wanting to just leave.\n\nTheir drink is ginormous. Never was I expected one drink to be the size of two, for the price of one.\n\nTheir egg is suspicious. I don't know if it's really egg. At least No.1 has an actual egg omelette."
      },
      {
        "score": 5,
        "comment": "Myst does not disappoint with their authentic Taiwanese beef noodle soup. The beef is tender and delicious. The noodles are chewy and fulfilling. The soup is rich and well seasoned. It is spicy by default, but you can ask them to make it non-spicy. Both flavours are great!"
      },
      {
        "score": 5,
        "comment": "We keep coming back to this restaurant for good food. There are so many selections to choose from. It's one of my go to restaurant. The staffs are very attentive to their customers as well."
      },
      {
        "score": 4,
        "comment": "Very good food. We ordered rice noodles which were nice and chewy. Also had western classic combo with lamb skewers and yam fries which were crispy and delicious. Curry sauce gave lamb great flavour. Also had egg rice which had nice variety of ingredients. Server came by only once for glass refill. In room next to screaming kids"
      },
      {
        "score": 5,
        "comment": "It's a really tasty and hearty restaurant. My favorite dishes are fried rice and deep-fried items. When you're craving something greasy, be sure to have a glass of beer with your meal. If you ever find yourself in Burnaby, I highly recommend giving it a try."
      },
      {
        "score": 4,
        "comment": "Decent experience with this store. Beef noodle soup was not as flavourful and rich as we had hoped. Thr stir fry noodle were lukewarmish but still tasty. Combos that came with toast/harshbrown and various items , although some selection requires $ top up. Accepts cash and debit. If you pay with credit, you have to pay additional 2% of the card charges."
      }
    ],
    "food_outlet": {
      "name": "MYST Asian Fusion",
      "location": "Metrotown"
    }
  },
  {
    "ratings": [
      {
        "score": 4,
        "comment": ""
      },
      {
        "score": 2,
        "comment": "I liked the atmosphere here, but the food was really lacking. I got a spicy beef ramen. It seems like the stock was not flavourful, so they added way too much minced garlic and spice to make it taste like something. All I could taste was garlic, salt and spice.\nI guess I was hoping for more depth in the broth. It came with two thin slices of beef. Especially for the price point, I think it wasn’t worth it…\nMy boyfriend got the veggie miso ramen, and same thing, it mostly tasted like salt, no flavour. Not enough veggies in it either"
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": "Great food, exceptional service"
      },
      {
        "score": 4,
        "comment": ""
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 4,
        "comment": "I'd say their ramen is great but it's not 5 star great if you've had some of the deeper broths. Though it's still multiple times better than Danbo. It's the best ramen on the west side of the city."
      },
      {
        "score": 4,
        "comment": ""
      },
      {
        "score": 5,
        "comment": "Delicious food and really sweet staff!"
      },
      {
        "score": 5,
        "comment": "Very tasty food, nice staff. The toilet is very clean (there are toothpicks, a mouse watch), the facility smells nice. Ramen with beef was very tasty."
      }
    ],
    "food_outlet": {
      "name": "KINTON RAMEN",
      "location": "UBC"
    }
  },
  {
    "ratings": [
      {
        "score": 2,
        "comment": "Food is not good and bland and pretty expensive"
      },
      {
        "score": 4,
        "comment": ""
      },
      {
        "score": 2,
        "comment": "Lady with the glasses is angry in the morning and needs better training on foodsafe..wearing cloth gloves, touching her face and glasses then inside of cups."
      },
      {
        "score": 3,
        "comment": "Food comes very fast, portion size seems smaller than before. And there’s only 1 type of baked pasta a day (it was fine though). Garlic toast was fine, the salad dressing was great!! Pasta and garlic toast for 11 dollars is alright. UBC cinnamon bun was tasty but hard, maybe it was from the day before. I want to try the roast chicken leg next time."
      },
      {
        "score": 1,
        "comment": "Worst coffee on campus lol lukewarm and watered down drip, latte is just a coffee flavoured milk drink"
      },
      {
        "score": 4,
        "comment": ""
      },
      {
        "score": 2,
        "comment": "I’ve been here a couple times and each time the experience gets less and less pleasant. My most recent experience involves purchasing a self serve coffee. The containers in the coffee were almost empty and I asked for a freshly brewed coffee. The old lady questioned why she should give me the freshly brewed coffee, which is rude. I told her that I would like it since the coffee was probably cold after sitting on the counter for 20+ minutes. She did not want to replace the old coffee with the freshly brewed coffee. There are levels of stinginess and by far this is pretty low. I will not be coming back here again. The area is convenient but I would rather spend some time walking to Starbucks than grab coffee here."
      },
      {
        "score": 5,
        "comment": "Very good cafe to have a quick bite or takeout on campus! The prices are reasonable, and they have plenty of study space around as well. I highly recommend their barbecue chicken flatbread :)"
      },
      {
        "score": 2,
        "comment": ""
      },
      {
        "score": 4,
        "comment": ""
      },
      {
        "score": 4,
        "comment": "pretty decent food prices and they take UBC card here (at least when I last tried!)\nI like the soups here as a filling and warming snack between my classes here. The pastas are pretty decent, but nothing special here. When I lived on campus, this was my favourite alternative to eating residence food!\nThe cashiers/servers here are honestly pretty unfriendly. Recently went and ordered soup and the lady didn't even look at me or say anything to me the entire time...not sure why."
      }
    ],
    "food_outlet": {
      "name": "Perugia Italian Caffè",
      "location": "UBC"
    }
  },
  {
    "ratings": [
      {
        "score": 1,
        "comment": "Only one worker working and doing everything. The milkshake tastes like chocolate milk, plain liquid, no thickness to it for $8. Waste of money, will not be returning"
      },
      {
        "score": 2,
        "comment": "Always love Vera but this location served me a really poor poutine portion with old tasty chess disappointments"
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 1,
        "comment": "One person on staff meant wait time was way too long and my burger was way undercooked."
      },
      {
        "score": 1,
        "comment": "Went during my lunch hour & ordered. I wait, & after 25 minutes pass watching the person who took my order have a conversation with another staff in the kitchen, I get up & start to hover at the counter. I guess they noticed, because I saw only then, did they start cooking my order. There's no ketchup available, so I asked for some. The lady seemed confused, then insited they keep it behind the counter. Finally after waiting another 20 minutes, I'm given my burger with smallest amount of ketchup possible, after this lady had sassed me about literally, 3 drips of water which fell from my fountain drink after pouring myself water. I didn't bother to try to ask for more kerchup I wanted. Bottom line, do not go here, unless you want horrendously slow & rude service."
      },
      {
        "score": 1,
        "comment": "Ordered a cheese burger and fries on the side via door dash… No cheese and no fries. Are you guys okay?"
      },
      {
        "score": 1,
        "comment": "I allocated $100 towards the purchase of food, however, I was disappointed to find a lack of fries in each bag, all of which tasted stale. Additionally, the quality of the chicken was subpar. "
      },
      {
        "score": 1,
        "comment": "I feel like they don’t fully cook their burgers. Terrible burger. Taste was awful"
      },
      {
        "score": 4,
        "comment": "Food was good. Young man behind the counter was excellent."
      }
    ],
    "food_outlet": {
      "name": "Vera's Burger Shack",
      "location": "UBC"
    }
  },
  {
    "ratings": [
      {
        "score": 5,
        "comment": "Wow, this soup was seriously amazing. I'm not the ramen type, so for all I know, maybe Danbo is \"normal\" in the world of ramen. Regardless, I wouldn't hesitate to come back. Also, the atmosphere was quaint. I really enjoyed it."
      },
      {
        "score": 5,
        "comment": "Filling and tasty. Service was attentive and friendly even despite always being busy. Note that there’s always a long wait time, we waiting for around 40min to get a table for 4 but it might be faster if you’re only 2 people."
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": "I had the vegan ramen and was blown away. Amazing, rich and delicious. Cannot wait to go back again."
      },
      {
        "score": 5,
        "comment": "Best Ramen in Vancouver! Fantastic choice of regular and vegan Ramen. Tastes amazing and prices are low compared to other places!\n\nHighly recommend this place, but be ready to queue, if you go for main lunch or dinner time."
      },
      {
        "score": 5,
        "comment": "There's a reason it's famous. It's delicious for Korean tastes and the portion size is generous. The staff is friendly. You can choose the thickness and spiciness of the noodles."
      },
      {
        "score": 4,
        "comment": "Be ready to wait an hour for a table of 2! Delicious ramen but is not \"that good\" to wait that long!"
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 5,
        "comment": ""
      }
    ],
    "food_outlet": {
      "name": "Ramen Danbo",
      "location": "Kitsilano"
    }
  },
  {
    "ratings": [
      {
        "score": 4,
        "comment": "Super friendly staff and quick service, the food is great :)"
      },
      {
        "score": 5,
        "comment": "5/5 would definitely recommend this place for friends! The food was amazing and the service was extraordinary "
      },
      {
        "score": 5,
        "comment": "My favorite items are the BBQ Pork and Sesame Chicken! Together, they pair so well by being sweet and salty. I always look forward to lunch now because everything is served hot"
      },
      {
        "score": 2,
        "comment": "i usually really like it here cause the portions are huge but me and my classmate got crazy food poisoning from here right before a big project was due so like?? maybe just don’t go right before closing..."
      },
      {
        "score": 1,
        "comment": "Ordered a Beef Fried Rice Noodle. The entire bowl had only a handful of beef (around 3-5 pieces). The rest is bean sprouts. Literally around 500g of bean sprouted on my bowl. And doused in so much oil I can't taste anything but the oil.\n\nI get that there's cost cutting measures but this is just inexcusable for the price."
      },
      {
        "score": 2,
        "comment": "Normal foods with premium prices"
      },
      {
        "score": 5,
        "comment": "An unexpected experience. Fresh and delicious. Such a comfortable and smooth mango smoothie. The staff, Chris & Sindy, are kind and friendly. The food is delicious, additional lemongrass chicken chop rice. Very fragrant"
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 2,
        "comment": "Big portions but sorry, it was not really good tasting.  Milk tea was watery as well. Disappointed"
      },
      {
        "score": 3,
        "comment": "I had the noodle soup....was pretty good."
      }
    ],
    "food_outlet": {
      "name": "Sesame",
      "location": "UBC"
    }
  },
  {
    "ratings": [
      {
        "score": 4,
        "comment": "Pizzas were ok. The dough is most as chewy as I’d like. The underside was a bit too charred for my liking. But other than that, it tastes like you would expect an Italian pizza to taste.\n\nBut what is that $7 for such a small slice of tiramisu…"
      },
      {
        "score": 2,
        "comment": "I really like the pesto pollo pizza, my only problem with it:\n\n1. Too expensive\n2. How did you manage to overcook the pizza like every single time I order??????"
      },
      {
        "score": 5,
        "comment": "Kids said that this was the best pizza they ever had! People here were super nice too!"
      },
      {
        "score": 5,
        "comment": "I ordered the prosciutto and rucola pizza which was made in a fire oven. It was really nice and chewy, the curse just at the right thickness. One of the best pizzas I have tried. And the place is huge where you can either sit at the sofas, tables or high chairs at the bar counter. Happy I came here."
      },
      {
        "score": 4,
        "comment": "Pizza was really quite disappointing compared to the past. Not all pieces had arugula and prosciutto. Crust was a bit undercooked. A great pity.\n\nGreat place otherwise for a quick bite."
      },
      {
        "score": 5,
        "comment": "Always an amazing time here! Solid pizzas - authentic too. Good old UBC days!"
      },
      {
        "score": 1,
        "comment": "I wonder why this place is still functioning. Total lack of competition?\n\nAffogato is a joke served in plastic cup.\nFood is awful. People behind the counter don’t give a ….. and rather not be there at all.\n\n“Mediocrity is the worst enemy of greatness.”"
      },
      {
        "score": 5,
        "comment": "Awesome tasting pizza. The dough is so fresh and the texture and thickness is perfect! The Margherita Salami Piccante special was so light yet tangy from the tomato sauce and tasted just right with balanced flavours. Pesto Pollo was also tasty. Made fresh in the fire oven. Can't wait to come back and eat it again.\n\nThey also have large wooden tables, couches, and study rooms so you can work, eat, and relax. Great place on campus for food, work, or just to chill."
      },
      {
        "score": 2,
        "comment": "If you look at the menu someone else posted here, you can see that they have increased the price per pizza by $4 over 8 months. I paid $17 for this pizza bianca and I’m not even full. My friend did recommend the prosciutto tho. Just want to point out that you can get so much more pizza at faith and pizza garden for the same price\n\nEdit: went back to try the prosciutto, it’s a good, honest pizza on its own. It’s just that you can get more at other places for the same price"
      },
      {
        "score": 3,
        "comment": "The pizza was great but the staff were cold and borderline rude."
      }
    ],
    "food_outlet": {
      "name": "Mercante",
      "location": "UBC"
    }
  },
  {
    "ratings": [
      {
        "score": 1,
        "comment": "Ordered chicken teriyaki. Feels like the chicken stayed in the fridge for years. Frozen on the inside and you will need very strong teeth to bite it open - better prepare a bowl for any falling teeth."
      },
      {
        "score": 1,
        "comment": "The vegetable tempura had RAW flour inside it. I didn’t take a picture because I was so traumatized. I ordered tempura donburi. I had indigestion afterwards and threw up."
      },
      {
        "score": 1,
        "comment": "If you need to get out of a commitment last-minute, here’s where you can get food poisoning! I recommend the poke bowls for this purpose..."
      },
      {
        "score": 2,
        "comment": "Their Kimchi soup is not good. Bland and watery."
      },
      {
        "score": 4,
        "comment": "I have ordered several time their Bulgogi over rice. It’s my fav dish from them because they made it right there and it’s always hot. The only bad thing about it is that it’s a kinda oily / greasy. And that recently I noticed they had been giving less in their portion. Tip: they will charge you a bit less if you bring your own container."
      },
      {
        "score": 5,
        "comment": ""
      },
      {
        "score": 1,
        "comment": "Why does every place on campus insist on price gouging broke college students. 7 dollars for a stale premade gas station California roll??? Why???? Bad people run this restaurant"
      },
      {
        "score": 1,
        "comment": "Donburi katsu was soggy, I got 3 vegetables, and the entire dish was 80% rice. Would not go again."
      },
      {
        "score": 1,
        "comment": "They accidentally charged me one dollar more than the price that was listed on the menu :( And my donburi had like 5 pieces of tofu and two pieces of broccoli and was mostly just rice :(("
      },
      {
        "score": 4,
        "comment": "Decent sushi, thickly sliced sashimi for an affordable price. Nice staffs."
      }
    ],
    "food_outlet": {
      "name": "Honour Roll Sushi",
      "location": "UBC"
    }
  }
]